tutorials/multiphase/vof/vofSolver/laminar/waves/3Dwaves/system/topoSetDict
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faceSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
actions
(
    {
        name f0;
        action new;
        type faceSet;
        // Actions to apply to pointSet. These are all the topoSetSource's ending
        // in ..ToFace (see the meshTools library).
        source boxToFace;
        sourceInfo
        {
            box  (74.9 -6 59.9) (75.1 3 90.1);
        }
    }
    {
        name f0;
        action add;
        type faceSet;
        // Actions to apply to pointSet. These are all the topoSetSource's ending
        // in ..ToFace (see the meshTools library).
        source boxToFace;
        sourceInfo
        {
            box  (74.9 -6 59.9) (100.1 3 60.1);
        }
    }
);
// ************************************************************************* //
